Repository: loc1263/CSFormat
Catalog: Resources/Resources.*.resx
Languages: es_es

# AppTitle
source: CSFormat - File Processor
es_es: CSFormat - Procesador de Archivos

source: Select format file
es_es: Seleccionar archivo de formato

source: Select input file
es_es: Seleccionar archivo de entrada

# SeparatorLabel
source: Separator:
es_es: Separador:

# HasHeaders
source: Include headers
es_es: Incluir encabezados

# ProcessButton
source: Process
es_es: Procesar

# CloseButton
source: Close
es_es: Cerrar

# FileFilter
source: CSV Files|*.csv|Text Files|*.txt|All Files|*.*
es_es: Archivos CSV|*.csv|Archivos de texto|*.txt|Todos los archivos|*.*

# ProcessComplete
source: Process completed. File saved to: {0}
es_es: Proceso completado. Archivo guardado en: {0}

# FileNotFound
source: File not found: {0}
es_es: Archivo no encontrado: {0}

# InvalidFormat
source: Invalid file format
es_es: Formato de archivo no válido

source: Processing...
es_es: Procesando...

# SelectFileFirst
source: Please select a file first
es_es: Por favor seleccione un archivo primero

# EnterSeparator
source: Please enter a separator
es_es: Por favor ingrese un separador

# NoFormatDefinitions
source: No valid format definitions found
es_es: No se encontraron definiciones de formato válidas

# InvalidLineFormat
source: Invalid line format: '{0}'
es_es: Formato de línea no válido: '{0}'

# FileEmpty
source: The file is empty or contains only blank lines
es_es: El archivo está vacío o solo contiene líneas en blanco

# LinesProcessed
source: Processed {0} of {1} lines ({2}%)
es_es: Procesadas {0} de {1} líneas ({2}%)

# TotalLinesProcessed
source: Total lines processed: {0}
es_es: Total de líneas procesadas: {0}

# FieldDefinitionsFound
source: Found {0} field definitions:
es_es: Se encontraron {0} definiciones de campo:

# FieldDefinitionFormat
source: - {0}: {1} characters
es_es: - {0}: {1} caracteres

# FirstLinePreview
source: First input line: '{0}'
es_es: Primera línea de entrada: '{0}'

# OutputFileVerified
source: Output file verified. Contains {0} lines.
es_es: Archivo de salida verificado. Contiene {0} líneas.

# OutputFileError
source: ERROR: Could not create output file
es_es: ERROR: No se pudo crear el archivo de salida

# MenuSettings
source: Settings
es_es: Configuración

# MenuLanguage
source: Language
es_es: Idioma

# MenuAbout
source: About
es_es: Acerca de

# LanguageEnglish
source: English
es_es: Inglés

# LanguageSpanish
source: Spanish
es_es: Español

# OpenButton
source: Open
es_es: Abrir
